Revit 2026 API

# LoadUsageCreate Method

---

Creates a new LoadUsage.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static LoadUsage Create(
	Document document,
	string name
)
```
```vb
Public Shared Function Create (
	document As Document,
	name As String
) As LoadUsage
```
```cpp
public:
static LoadUsage^ Create(
	Document^ document,
	String^ name
)
```
```fsharp
static member Create :
        document : Document *
        name : string -> LoadUsage
```

#### Parameters

document Document
     The Document to which new load usage element will be added.
name String
     The name of the load usage.

#### Return Value

LoadUsage The newly created load usage element if successful,  otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | The given name is not unique |
| ArgumentNullException | A non-optional argument was null |

#### Reference

LoadUsage Class

Autodesk.Revit.DB.Structure Namespace